//Напишите программу, 
//которая по заданному номеру четверти, 
//показывает диапазон возможных координат 
//точек в этой четверти (x и y).

Console.WriteLine("Введите номер четверти: ");
int qarter = Convert.ToInt32(Console.ReadLine());